app/views/course_groups/show.html.slim

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
h1
	= "#{@course_group.course.subject.name} #{@course_group.group.grade}#{@course_group.group.name}"
	.pull-right

SELECT "marks".* FROM "marks" WHERE "marks"."user_id" = $1 AND "marks"."course_id" = 1  [["user_id", 3]]
---
- if current_user.student?
	- current_user.marks.where(course_id: @course_group.course).each do |mark|