app/views/groups/index.html.slim

          tbody
            = render partial: 'groups/group_row', collection: @school.groups, as: :group
---
SELECT "groups".* FROM "groups"