app/views/courses/index.html.slim

SELECT "courses".* FROM "courses"
---
        - @school.school_years.each do |year|
          - courses = Course.in_year(@group.id, year.year.to_s).ordered