app/controllers/courses_controller.rb

SELECT "course_groups".* FROM "course_groups" WHERE "course_groups"."group_id" = $1  [["group_id", 1]]
---
  def index
    case current_user.role
    when 'teacher'
      @course_groups = current_user.course_groups
    when 'student'
      @course_groups = current_user.group.course_groups