app/controllers/courses_controller.rb

  def index
    @courses = policy_scope(@group.courses.ordered_by_subject)
---
SELECT "courses".* FROM "courses"

    def set_school
      @school = School.find(params[:school_id])
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_group
      @group = @school.groups.find(params[:group_id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_course
      @course = @group.courses.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]