app/controllers/marks_controller.rb

  def create
    @mark = Mark.new(mark_params)
    authorize @mark
    respond_to do |format|
      if @mark.save
---
INSERT INTO "marks" ("course_id", "user_id", "mark", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["course_id", 1], ["user_id", 3], ["mark", "5"], ["created_at", "2017-08-07 14:39:20.117320"], ["updated_at", "2017-08-07 14:39:20.117320"]]

    def set_course
      @course = @group.courses.find_by_id(params[:course_id]) || @group.courses.first
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_mark
      @mark = Mark.find(params[:id])
---
SELECT  "marks".* FROM "marks" WHERE "marks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]