app/controllers/subjects_controller.rb

SELECT "subjects".* FROM "subjects"
---
  def index
    @subjects = @school.subjects.all

INSERT INTO "subjects" ("name", "grade") VALUES ($1, $2) RETURNING "id"  [["name", "Български език и литература"], ["grade", 5]]
---
  def create
    @subject = @school.subjects.new(subject_params)

    respond_to do |format|
      if @subject.save

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_subject
    @subject = Subject.find(params[:id])