app/controllers/users_controller.rb

INSERT INTO "users" ("school_id", "role_id", "group_id", "name", "password", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(create_params)
    if @user.save

UPDATE "users" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Kristiyan"], ["password_digest", "$2a$10$zUZr6Ke5wF30oSJQWvVA/uGyTQaHeR849cDcjvvzXi4gvDO3SSEV."], ["updated_at", "2017-07-22 12:33:28.010516"], ["id", 1]]
---
  def update
    respond_to do |format|
      if current_user.update(update_params)